#!/usr/bin/env python3
# ภูริณัฐ ภาณุพงศ์สกุล
# 640510676
# Lab 07
# Problem 4
# 204111 Sec 002

def main():
    print(life_path(int(input())))


def life_path(n): 
    while n>9:                      #เลข life path จะไม่เกินหลักหน่วยดังนั้นจึงให้ลูปจนกว่าค่า n<=9
        if n<10 :                   #ในกรณีที่ค่า n น้อยกว่า 10 (n<=9) ให้ค่า n นั้นเป็น จน เดิม
            n = n
        else:                       #แต่ถ้าหากค่า n>=10 ให้นำ n//10 เพื่อนำตัวท้ายออก และบวกด้วย n%10 ซึ่งเป็นตัวท้าย
            n = (n//10) + (n%10)    
    return n                        #โดยจะทำงานจนกว่าค่า n นั้นน้อยกว่า 10 แล้วคืนค่า n ออกมา

if __name__ == '__main__':
    main()