#!/usr/bin/env python3
# ภูริณัฐ ภาณุพงศ์สกุล
# 640510676
# Lab 02
# Problem 4
# 204111 Sec 002

x =int(input("Input number of milliseconds: ")) #รับค่า x เป็น int มาคำนวณ

day1 =(x//86400000) #นำค่า x หารปิดเศษทิ้งแล้วใช้ค่านี้แสดงผล
day2 =(x%86400000) #นำค่า x หารเอาเศษเพื่อคำนวณในข้อต่อไป

hr1 =(day2//3600000) #นำ day2 ที่เป็นตัวแปรเอาเศษมาคิดต่อ โดยการหารปัดเศาทิ้ง
hr2 =(day2%3600000) #นำ day2 มาหารเอาเศษไปคิดข้อถัดไป

min1 =(hr2//60000) #นำ hr2 หารปัดเศษ
min2 =(hr2%60000) #นำ hr2 หารเอาเศษ

s =(min2//1000) #นำ min หารเอาเศษเพื่อหา s 

ms =(x%1000) #นำ x มาหารเอาเศษซึ่งจะไม่เกิน 900

print ("Results = %.d day(s), %.d hour(s), %.d minute(s), %.d second(s), and %.d millisec(s) " %(day1,hr1,min1,s,ms)) 
#แสดงค่าค่าฟอร์มที่กำหนด
